# PANDAS

In [1]:
import pandas as pd

* Series --- 1d array
* Data Frame ---2d array(Table format, row & col)

In [2]:
a=pd.Series([])
b=pd.Series([1,2,33,23,4,2])
c=pd.Series((34,23,11,34,42))
d=pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\sudheer singh\AppData\Local\Temp\ipykernel_21496\1037961842.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a=pd.Series([])

In [3]:
print(type(a))
print(type(b))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
b

0     1
1     2
2    33
3    23
4     4
5     2
dtype: int64

In [6]:
c

0    34
1    23
2    11
3    34
4    42
dtype: int64

In [7]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [8]:
# abcd, 1234= index

In [9]:
import numpy as np

In [10]:
n= np.array([1,3,3,2,2])

In [13]:
x= pd.Series(n)

In [14]:
x

0    1
1    3
2    3
3    2
4    2
dtype: int32

In [15]:
type(x)

pandas.core.series.Series

In [16]:
b=pd.Series([1,2,[33,10],[23,27],4,2])

In [17]:
b

0           1
1           2
2    [33, 10]
3    [23, 27]
4           4
5           2
dtype: object

In [18]:
b=pd.Series([1,2,['bts',33],23,4,2])

In [19]:
b

0            1
1            2
2    [bts, 33]
3           23
4            4
5            2
dtype: object

In [20]:
b[2]

['bts', 33]

In [21]:
b[2][0]

'bts'

In [22]:
b[0:4:2]

0            1
2    [bts, 33]
dtype: object

In [23]:
d=pd.Series({'a':10,'b':15,'c':56,'d':99})

In [24]:
d['d']

99

In [28]:
d['a'],d['b']

(10, 15)

In [29]:
d['a':'c']

a    10
b    15
c    56
dtype: int64

In [30]:
s=pd.Series([12,52,42,10,23],index=['e','a','b','h','t'])

In [31]:
s

e    12
a    52
b    42
h    10
t    23
dtype: int64

In [33]:
s=pd.Series([12,52,42,10,23],index=list('qwert'))

In [34]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [37]:
s2=pd.Series([12,52,42,12,10,52,23])

In [38]:
s2

0    12
1    52
2    42
3    12
4    10
5    52
6    23
dtype: int64

In [40]:
s2.value_counts()

12    2
52    2
42    1
10    1
23    1
dtype: int64

In [41]:
s2.argmax()

1

In [42]:
s2.argmin()

4

In [43]:
s.argmax()

1

# location qwert

In [44]:
s=pd.Series([12,52,42,10,23],index=list('qwert'))

In [45]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [46]:
s.argmax()

1

In [47]:
s.argmin()

3

In [49]:
s.idxmax()

'w'

In [50]:
s.idxmin()

'r'

# DATAFRAME

In [51]:
a=pd.DataFrame()
b=pd.DataFrame([23,1,33,44,23])

In [52]:
a

Empty DataFrame
Columns: []
Index: []

In [53]:
b

    0
0  23
1   1
2  33
3  44
4  23

In [56]:
type(b)

pandas.core.frame.DataFrame

In [58]:
c=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [59]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [62]:
c=pd.DataFrame([[1,2,3,4,5],[10,20,30,16,24],[7,8,9,12,34],[2,4,2,5,3],[2,4,2,3,4]])

In [63]:
c

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  16  24
2   7   8   9  12  34
3   2   4   2   5   3
4   2   4   2   3   4

In [66]:
c1=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9],[2,3,4],[2,4,5],[5,7,5],[3,5,7],[3,8,6]])

In [67]:
c1

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9
3   2   3   4
4   2   4   5
5   5   7   5
6   3   5   7
7   3   8   6

In [70]:
c1.tail(2)

   0  1  2
6  3  5  7
7  3  8  6

In [71]:
c1.tail()

   0  1  2
3  2  3  4
4  2  4  5
5  5  7  5
6  3  5  7
7  3  8  6

In [73]:
c1.head() # by default last 5 will show

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9
3   2   3   4
4   2   4   5

In [75]:
c1.sample()

   0  1  2
7  3  8  6

In [76]:
c1.sample(2) # randomely

   0  1  2
2  7  8  9
5  5  7  5

# NAN

In [80]:
c2=pd.DataFrame([[1,2,3,5],[10,20,16,24],[7,8,9,12,34],[2,4,2,3],[2,4,2,3,4]])  #blank

##

In [81]:
c2

    0   1   2   3     4
0   1   2   3   5   NaN
1  10  20  16  24   NaN
2   7   8   9  12  34.0
3   2   4   2   3   NaN
4   2   4   2   3   4.0

In [82]:
c3=pd.DataFrame([[1,np.nan,3],[10,20,np.nan],[np.nan,8,9]]) # using np.nan

In [83]:
c3

      0     1    2
0   1.0   NaN  3.0
1  10.0  20.0  NaN
2   NaN   8.0  9.0

In [85]:
c4=pd.DataFrame([[1,'missing',3],[10,20,'missing'],['missing',8,9]]) # using np.nan

In [86]:
c4

         0        1        2
0        1  missing        3
1       10       20  missing
2  missing        8        9

In [92]:
c5=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]],columns=['a','b','c'])

c5

In [93]:
c5

    a   b   c
0   1   2   3
1  10  20  30
2   7   8   9

In [101]:
c5=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]],index=['d','e','f'],columns=['a','b','c'])

#####

In [97]:
c5

    a   b   c
d   1   2   3
e  10  20  30
f   7   8   9

In [102]:
c5['a']

d     1
e    10
f     7
Name: a, dtype: int64

In [104]:
c5[['a','c']]

    a   c
d   1   3
e  10  30
f   7   9

In [107]:
c6=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]],columns=['a','b','c'])

In [108]:
c6

    a   b   c
0   1   2   3
1  10  20  30
2   7   8   9

In [116]:
c6[['a','b']].head(2)

    a   b
0   1   2
1  10  20

In [118]:
c6.shape

(3, 3)

In [121]:
c6[['a']].max()

a    10
dtype: int64

In [128]:
c6['d']=[3,5,6]

In [129]:
c6

    a   b   c  d
0   1   2   3  3
1  10  20  30  5
2   7   8   9  6

# summation of two columns

In [142]:
c6['sumcd']=c6['c']+c6['d']

In [143]:
c6

    a   b   c  d  sumcd
0   1   2   3  3      6
1  10  20  30  5     35
2   7   8   9  6     15

# greater than

In [145]:
c6['sumcd']>10

0    False
1     True
2     True
Name: sumcd, dtype: bool

In [146]:
f=c6['sumcd']>10

In [147]:
c6[f]

    a   b   c  d  sumcd
1  10  20  30  5     35
2   7   8   9  6     15